package com.lawlett.taskmanageruikit.finance;

public class AdviceText {
    private static final String[][] advice = {
            { "Относитесь к деньгам с уважением ","Ваши деньги это ваше «законсервированное» время и энергия, которые вы потратили, чтобы их заработать."},
            {"Заведите себе привычку вести учет доходов и расходов в электронном или письменном виде. "," "},
            {"Избавьтесь от кредитных карт, потребительских кредитов и прочих долгов."," Долги давят психологически, вгоняют людей в стресс и заставляют беспокоиться о завтрашнем дне. В итоге, за пользование чужими деньгами вы заплатите не только своими деньгами, но и своим здоровьем и своей энергией."},
            {"Живите по средствам."," Когда вы нарушаете это правило, вы теряете гармонию в собственной жизни. Вы тратите деньги, которых не заработали, Фактически, пользуясь тем, что вам не принадлежит, вы можете лишиться этого в любой момент! Осознайте разницу между своими потребностями — тем, что вам действительно нужно, и своими желаниями — тем, что «неплохо было бы иметь». Расставьте приоритеты так, чтобы сначала закрывать все потребности, а то что остается пускать на хотелки и развлечения."},
            {"Откажитесь от импульсивных покупок и необязательных трат."," Составляйте список покупок перед походом в магазин и придерживайтесь его."},
            { "Работайте над повышением своих доходов."," Узнайте, за что конкретно вам платят деньги, и развивайтесь в этой области. Приобретение более глубоких знаний в узкой нише, расширение сферы ваших компетенций и ответственности, повышение качества выполненной работы, а также более быстрое выполнение работы, могут стать ключом к повышению ваших доходов."},
            { "Не ждите быстрых результатов."," Увеличение дохода — это результат длительной и регулярной работы, поэтому запаситесь терпением и начинайте двигаться к цели небольшими шагами."},
            { "Создавайте и приобретайте дополнительные источники дохода."," Секрет финансовой стабильности многих успешных людей заключается в множественных источниках дохода."},
            { "Берегите деньги — не тратьте их на азартные игры, финансовые пирамиды, сомнительные предприятия и сделки."," "},
            {"Не давайте деньги в долг"," Велики риски и с людьми отношения испортить и деньги потерять. Оставьте банкам их работу"},
            {"Не разбрасывайтесь даже небольшими деньгами."," Копейка бережет не только рубль, но и доллар, и евро!"},
            {"Откажитесь от вредных финансовых привычек,"," Регулярно вытягивающих у вас деньги из кошелька, но не приносящих уже былого удовольствия. Мы тратим деньги, чтобы получить какие-то эмоции. При одинаковой цене разные вещи могут приносить разное количество эмоций. Например, кофе в кафе за 200 рублей, который вы привыкли выпивать после обеда, уже не вызывает восторга и удовлетворения, но все еще обходится вашему бюджету в 1000 рублей в неделю. За ту же тысячу вы могли бы получить гораздо больше эмоций, сходив на массаж или в кино."},
            {"Не стесняйтесь спросить о скидке и воспользоваться специальными предложениями."," Продавцу наверняка будет выгоднее предложить вам скидку и продать товар, чем отказать в скидке и не продать ничего."},
            {"Изучайте литературу по финансовой грамотности."," Ваше благосостояние напрямую зависит от уровня вашей финансовой грамотности!"},
            {"Заведите себе личный финансовый план и следуйте ему."," "},
            {"Сначала платите себе — поздно пытаться откладывать деньги после того, как вы их уже потратили."," Откладывать часть денег на достижение своих финансовых целей нужно сразу же, как только вы их получили."},
            {"Инвестирование проще, и доступнее чем вы думаете."," К тому же некоторые финансовые инструменты позволяют во многом автоматизировать этот процесс. Главное понять, настолько ли это важно для вас, что вы готовы начать действовать?"},
            {"Покупайте необходимые качественные вещи."," Качественные продукты, как правило стоят дороже, зато в использовании обходится дешевле."},
            {"Следите за тем, чтобы ваши доходы всегда росли быстрее ваших расходов."," При этом ваши доходы всегда должны быть больше ваших расходов. Это один из основных принципов финансового благополучия."},
            {"Всегда считайте деньги, даже если они маленькие."," Небольшие ежедневные траты могут складываться в огромные суммы за годы и в еще большие за десятилетия. Каждый раз, когда вы говорите себе что-то вроде «1000 рублей не деньги, не жалко и потерять», вы отбираете у себя самого в будущем десятки и сотни тысяч, в которые бы превратилась эта тысяча, если бы вы её грамотно инвестировали."},
            {"Сравните цены в разных местах перед тем как что-то купить."," Лучше всего измерять цену в часах вашей жизни — сколько времени вам придется работать, чтобы набрать нужную сумму на эту покупку. Так вам будет проще сравнивать цену товара, которую вы платите с его ценностью для вас. Готовы ли вы отдать час жизни за чашку кофе? А месяц жизни за новый телефон?"},
            {"Не завидуйте другим людям, а учитесь у них тому, в чем они разбираются лучше вас. "," "},
            {"Осознайте, что ваше финансовое благополучие целиком и полностью зависит от вас и ваших действий."," "},
            {"Сядьте на «денежную диету» прямо сейчас!"," Измените свой образ жизни прямо сейчас, не откладывая. Это позволит вам сэкономить в течение года тысячи долларов."}};

public static String getTitleAdvice(int position){
    return advice[position][0];
}
public static String getDescAdvice(int position){
    return advice[position][1];
}
}
